app/controllers/crushes_controller.rb

  def index
    @crushes = Crush.search(params[:search])
---
SELECT "crushes".* FROM "crushes"

  def create
    @crush = Crush.new(crush_params)

    respond_to do |format|
      if @crush.save
---
INSERT INTO "crushes" ("crush_number", "message_for_them", "why_you_like_them", "things_you_should_change", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"

    def set_crush
      @crush = Crush.find(params[:id])
---
SELECT  "crushes".* FROM "crushes" WHERE "crushes"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]