app/controllers/moments_controller.rb

  def index
    @moments = Moment.all.latest_created_at
---
SELECT "moments".* FROM "moments" ORDER BY "moments"."created_at" DESC

  def create
    @moment = Moment.new(moment_params)

    respond_to do |format|
      if @moment.save
---
INSERT INTO "moments" ("unexpected_happiness", "disappointments", "message", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["unexpected_happiness", "hvyvy"], ["disappointments", "hvhvjhvhvhjvhj"], ["message", "h jh jh j"], ["created_at", 2016-07-24 18:14:31 UTC], ["updated_at", 2016-07-24 18:14:31 UTC]]

  def update
    respond_to do |format|
      if @moment.update(moment_params)
---
UPDATE "moments" SET "unexpected_happiness" = $1, "disappointments" = $2, "updated_at" = $3 WHERE "moments"."id" = $4  [["unexpected_happiness", "Saw her. All i know about her is Vadapalani................"], ["disappointments", ""], ["updated_at", 2016-07-31 17:15:26 UTC], ["id", 11]]

  def destroy
    @moment.destroy
---
DELETE FROM "moments" WHERE "moments"."id" = $1  [["id", 4]]

    def set_moment
      @moment = Moment.find(params[:id])
---
SELECT  "moments".* FROM "moments" WHERE "moments"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]