app/controllers/search_controller.rb

SELECT "crushes".* FROM "crushes"
---
  def index
    @crushes = Crush.all