app/controllers/wishes_controller.rb

  def index
    @wishes = Wish.all
---
SELECT "wishes".* FROM "wishes"

  def create
    @wish = Wish.new(wish_params)

    respond_to do |format|
      if @wish.save
---
INSERT INTO "wishes" ("wish", "reason", "should_happen_on", "completed", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"

    def set_wish
      @wish = Wish.find(params[:id])
---
SELECT  "wishes".* FROM "wishes" WHERE "wishes"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]